IDEA StatiCa Open Model
Stirrup Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The Stirrup type exposes the following members.
Properties
Name | Description
AnchorageLenght
 Anchorage Lenght
Diameter
 Diameter
DiameterOfMandrel
 Radius of stirrup mandrel - refering to stirrup axis
Distance
 Longitudinal distance between stirrups
Geometry
 Geometry
IsClosed
 Open / Closed stirrup
Material
 Material
ShearCheck
 Status of shear check, not possible for detailing stirrup
TorsionCheck
 Status of torsion check, not possible for detailing stirrup
Top
See Also
Reference
Stirrup Class
IdeaRS.OpenModel.CrossSection Namespace